zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/tc.h
/**
 * \brief Component description for PIC32CZ/CA70 TC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_TC_COMPONENT_H_
#define _PIC32CZ_CA70_TC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_TC Timer Counter
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TC */
/* ========================================================================== */

/* -------- TC_CCR : (TC Offset: 0x00) (/W 32) Channel Control Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CLKEN:1;                   /**< bit:      0  Counter Clock Enable Command                  */
    uint32_t CLKDIS:1;                  /**< bit:      1  Counter Clock Disable Command                 */
    uint32_t SWTRG:1;                   /**< bit:      2  Software Trigger Command                      */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __TC_CCR_bits_t;

#define TC_CCR_CLKEN_Pos                      (0)                                            /**< (TC_CCR) Counter Clock Enable Command Position */
#define TC_CCR_CLKEN_Msk                      (0x1U << TC_CCR_CLKEN_Pos)                     /**< (TC_CCR) Counter Clock Enable Command Mask */
#define TC_CCR_CLKDIS_Pos                     (1)                                            /**< (TC_CCR) Counter Clock Disable Command Position */
#define TC_CCR_CLKDIS_Msk                     (0x1U << TC_CCR_CLKDIS_Pos)                    /**< (TC_CCR) Counter Clock Disable Command Mask */
#define TC_CCR_SWTRG_Pos                      (2)                                            /**< (TC_CCR) Software Trigger Command Position */
#define TC_CCR_SWTRG_Msk                      (0x1U << TC_CCR_SWTRG_Pos)                     /**< (TC_CCR) Software Trigger Command Mask */
#define TC_CCR_Msk                            (0x00000007UL)                                 /**< (TC_CCR) Register Mask  */

/* -------- TC_CMR : (TC Offset: 0x04) (R/W 32) Channel Mode Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t TCCLKS:3;                  /**< bit:   0..2  Clock Selection                               */
    uint32_t CLKI:1;                    /**< bit:      3  Clock Invert                                  */
    uint32_t BURST:2;                   /**< bit:   4..5  Burst Signal Selection                        */
    uint32_t :9;                        /**< bit:  6..14  Reserved                                      */
    uint32_t WAVE:1;                    /**< bit:     15  Waveform Mode                                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  struct
  { // Capture mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t LDBSTOP:1;                 /**< bit:      6  Counter Clock Stopped with RB Loading         */
    uint32_t LDBDIS:1;                  /**< bit:      7  Counter Clock Disable with RB Loading         */
    uint32_t ETRGEDG:2;                 /**< bit:   8..9  External Trigger Edge Selection               */
    uint32_t ABETRG:1;                  /**< bit:     10  TIOAx or TIOBx External Trigger Selection     */
    uint32_t :3;                        /**< bit: 11..13  Reserved                                      */
    uint32_t CPCTRG:1;                  /**< bit:     14  RC Compare Trigger Enable                     */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t LDRA:2;                    /**< bit: 16..17  RA Loading Edge Selection                     */
    uint32_t LDRB:2;                    /**< bit: 18..19  RB Loading Edge Selection                     */
    uint32_t SBSMPLR:3;                 /**< bit: 20..22  Loading Edge Subsampling Ratio                */
    uint32_t :9;                        /**< bit: 23..31  Reserved                                      */
  };
  struct
  { // Waveform mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t CPCSTOP:1;                 /**< bit:      6  Counter Clock Stopped with RC Compare         */
    uint32_t CPCDIS:1;                  /**< bit:      7  Counter Clock Disable with RC Loading         */
    uint32_t EEVTEDG:2;                 /**< bit:   8..9  External Event Edge Selection                 */
    uint32_t EEVT:2;                    /**< bit: 10..11  External Event Selection                      */
    uint32_t ENETRG:1;                  /**< bit:     12  External Event Trigger Enable                 */
    uint32_t WAVSEL:2;                  /**< bit: 13..14  Waveform Selection                            */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t ACPA:2;                    /**< bit: 16..17  RA Compare Effect on TIOAx                    */
    uint32_t ACPC:2;                    /**< bit: 18..19  RC Compare Effect on TIOAx                    */
    uint32_t AEEVT:2;                   /**< bit: 20..21  External Event Effect on TIOAx                */
    uint32_t ASWTRG:2;                  /**< bit: 22..23  Software Trigger Effect on TIOAx              */
    uint32_t BCPB:2;                    /**< bit: 24..25  RB Compare Effect on TIOBx                    */
    uint32_t BCPC:2;                    /**< bit: 26..27  RC Compare Effect on TIOBx                    */
    uint32_t BEEVT:2;                   /**< bit: 28..29  External Event Effect on TIOBx                */
    uint32_t BSWTRG:2;                  /**< bit: 30..31  Software Trigger Effect on TIOBx              */
  };
  uint32_t w;
} __TC_CMR_bits_t;

