zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/tc.h
#define TC_CMR_BCPB(value)                    (TC_CMR_BCPB_Msk & ((value) << TC_CMR_BCPB_Pos))
#define   TC_CMR_BCPB_NONE_Val                (0x0U)                                         /**< (TC_CMR) NONE  */
#define   TC_CMR_BCPB_SET_Val                 (0x1U)                                         /**< (TC_CMR) SET  */
#define   TC_CMR_BCPB_CLEAR_Val               (0x2U)                                         /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BCPB_TOGGLE_Val              (0x3U)                                         /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BCPB_NONE                      (TC_CMR_BCPB_NONE_Val << TC_CMR_BCPB_Pos)      /**< (TC_CMR) NONE Position  */
#define TC_CMR_BCPB_SET                       (TC_CMR_BCPB_SET_Val << TC_CMR_BCPB_Pos)       /**< (TC_CMR) SET Position  */
#define TC_CMR_BCPB_CLEAR                     (TC_CMR_BCPB_CLEAR_Val << TC_CMR_BCPB_Pos)     /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BCPB_TOGGLE                    (TC_CMR_BCPB_TOGGLE_Val << TC_CMR_BCPB_Pos)    /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_BCPC_Pos                       (26)                                           /**< (TC_CMR) RC Compare Effect on TIOBx Position */
#define TC_CMR_BCPC_Msk                       (0x3U << TC_CMR_BCPC_Pos)                      /**< (TC_CMR) RC Compare Effect on TIOBx Mask */
#define TC_CMR_BCPC(value)                    (TC_CMR_BCPC_Msk & ((value) << TC_CMR_BCPC_Pos))
#define   TC_CMR_BCPC_NONE_Val                (0x0U)                                         /**< (TC_CMR) NONE  */
#define   TC_CMR_BCPC_SET_Val                 (0x1U)                                         /**< (TC_CMR) SET  */
#define   TC_CMR_BCPC_CLEAR_Val               (0x2U)                                         /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BCPC_TOGGLE_Val              (0x3U)                                         /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BCPC_NONE                      (TC_CMR_BCPC_NONE_Val << TC_CMR_BCPC_Pos)      /**< (TC_CMR) NONE Position  */
#define TC_CMR_BCPC_SET                       (TC_CMR_BCPC_SET_Val << TC_CMR_BCPC_Pos)       /**< (TC_CMR) SET Position  */
#define TC_CMR_BCPC_CLEAR                     (TC_CMR_BCPC_CLEAR_Val << TC_CMR_BCPC_Pos)     /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BCPC_TOGGLE                    (TC_CMR_BCPC_TOGGLE_Val << TC_CMR_BCPC_Pos)    /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_BEEVT_Pos                      (28)                                           /**< (TC_CMR) External Event Effect on TIOBx Position */
#define TC_CMR_BEEVT_Msk                      (0x3U << TC_CMR_BEEVT_Pos)                     /**< (TC_CMR) External Event Effect on TIOBx Mask */
#define TC_CMR_BEEVT(value)                   (TC_CMR_BEEVT_Msk & ((value) << TC_CMR_BEEVT_Pos))
#define   TC_CMR_BEEVT_NONE_Val               (0x0U)                                         /**< (TC_CMR) NONE  */
#define   TC_CMR_BEEVT_SET_Val                (0x1U)                                         /**< (TC_CMR) SET  */
#define   TC_CMR_BEEVT_CLEAR_Val              (0x2U)                                         /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BEEVT_TOGGLE_Val             (0x3U)                                         /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BEEVT_NONE                     (TC_CMR_BEEVT_NONE_Val << TC_CMR_BEEVT_Pos)    /**< (TC_CMR) NONE Position  */
#define TC_CMR_BEEVT_SET                      (TC_CMR_BEEVT_SET_Val << TC_CMR_BEEVT_Pos)     /**< (TC_CMR) SET Position  */
#define TC_CMR_BEEVT_CLEAR                    (TC_CMR_BEEVT_CLEAR_Val << TC_CMR_BEEVT_Pos)   /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BEEVT_TOGGLE                   (TC_CMR_BEEVT_TOGGLE_Val << TC_CMR_BEEVT_Pos)  /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_BSWTRG_Pos                     (30)                                           /**< (TC_CMR) Software Trigger Effect on TIOBx Position */
#define TC_CMR_BSWTRG_Msk                     (0x3U << TC_CMR_BSWTRG_Pos)                    /**< (TC_CMR) Software Trigger Effect on TIOBx Mask */
#define TC_CMR_BSWTRG(value)                  (TC_CMR_BSWTRG_Msk & ((value) << TC_CMR_BSWTRG_Pos))
#define   TC_CMR_BSWTRG_NONE_Val              (0x0U)                                         /**< (TC_CMR) NONE  */
#define   TC_CMR_BSWTRG_SET_Val               (0x1U)                                         /**< (TC_CMR) SET  */
#define   TC_CMR_BSWTRG_CLEAR_Val             (0x2U)                                         /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BSWTRG_TOGGLE_Val            (0x3U)                                         /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BSWTRG_NONE                    (TC_CMR_BSWTRG_NONE_Val << TC_CMR_BSWTRG_Pos)  /**< (TC_CMR) NONE Position  */
#define TC_CMR_BSWTRG_SET                     (TC_CMR_BSWTRG_SET_Val << TC_CMR_BSWTRG_Pos)   /**< (TC_CMR) SET Position  */
#define TC_CMR_BSWTRG_CLEAR                   (TC_CMR_BSWTRG_CLEAR_Val << TC_CMR_BSWTRG_Pos)  /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BSWTRG_TOGGLE                  (TC_CMR_BSWTRG_TOGGLE_Val << TC_CMR_BSWTRG_Pos)  /**< (TC_CMR) TOGGLE Position  */

/* -------- TC_SMMR : (TC Offset: 0x08) (R/W 32) Stepper Motor Mode Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t GCEN:1;                    /**< bit:      0  Gray Count Enable                             */
    uint32_t DOWN:1;                    /**< bit:      1  Down Count                                    */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __TC_SMMR_bits_t;

#define TC_SMMR_GCEN_Pos                      (0)                                            /**< (TC_SMMR) Gray Count Enable Position */
#define TC_SMMR_GCEN_Msk                      (0x1U << TC_SMMR_GCEN_Pos)                     /**< (TC_SMMR) Gray Count Enable Mask */
#define TC_SMMR_DOWN_Pos                      (1)                                            /**< (TC_SMMR) Down Count Position */
#define TC_SMMR_DOWN_Msk                      (0x1U << TC_SMMR_DOWN_Pos)                     /**< (TC_SMMR) Down Count Mask */
#define TC_SMMR_Msk                           (0x00000003UL)                                 /**< (TC_SMMR) Register Mask  */

/* -------- TC_RAB : (TC Offset: 0x0c) (R/ 32) Register AB (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t RAB:32;                    /**< bit:  0..31  Register A or Register B                      */
  };
  uint32_t w;
} __TC_RAB_bits_t;

