zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/tc.h
#define TC_RAB_RAB_Pos                        (0)                                            /**< (TC_RAB) Register A or Register B Position */
#define TC_RAB_RAB_Msk                        (0xFFFFFFFFU << TC_RAB_RAB_Pos)                /**< (TC_RAB) Register A or Register B Mask */
#define TC_RAB_RAB(value)                     (TC_RAB_RAB_Msk & ((value) << TC_RAB_RAB_Pos))
#define TC_RAB_Msk                            (0xFFFFFFFFUL)                                 /**< (TC_RAB) Register Mask  */

/* -------- TC_CV : (TC Offset: 0x10) (R/ 32) Counter Value (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CV:32;                     /**< bit:  0..31  Counter Value                                 */
  };
  uint32_t w;
} __TC_CV_bits_t;

#define TC_CV_CV_Pos                          (0)                                            /**< (TC_CV) Counter Value Position */
#define TC_CV_CV_Msk                          (0xFFFFFFFFU << TC_CV_CV_Pos)                  /**< (TC_CV) Counter Value Mask */
#define TC_CV_CV(value)                       (TC_CV_CV_Msk & ((value) << TC_CV_CV_Pos))
#define TC_CV_Msk                             (0xFFFFFFFFUL)                                 /**< (TC_CV) Register Mask  */

/* -------- TC_RA : (TC Offset: 0x14) (R/W 32) Register A (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t RA:32;                     /**< bit:  0..31  Register A                                    */
  };
  uint32_t w;
} __TC_RA_bits_t;

#define TC_RA_RA_Pos                          (0)                                            /**< (TC_RA) Register A Position */
#define TC_RA_RA_Msk                          (0xFFFFFFFFU << TC_RA_RA_Pos)                  /**< (TC_RA) Register A Mask */
#define TC_RA_RA(value)                       (TC_RA_RA_Msk & ((value) << TC_RA_RA_Pos))
#define TC_RA_Msk                             (0xFFFFFFFFUL)                                 /**< (TC_RA) Register Mask  */

/* -------- TC_RB : (TC Offset: 0x18) (R/W 32) Register B (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t RB:32;                     /**< bit:  0..31  Register B                                    */
  };
  uint32_t w;
} __TC_RB_bits_t;

#define TC_RB_RB_Pos                          (0)                                            /**< (TC_RB) Register B Position */
#define TC_RB_RB_Msk                          (0xFFFFFFFFU << TC_RB_RB_Pos)                  /**< (TC_RB) Register B Mask */
#define TC_RB_RB(value)                       (TC_RB_RB_Msk & ((value) << TC_RB_RB_Pos))
#define TC_RB_Msk                             (0xFFFFFFFFUL)                                 /**< (TC_RB) Register Mask  */

/* -------- TC_RC : (TC Offset: 0x1c) (R/W 32) Register C (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t RC:32;                     /**< bit:  0..31  Register C                                    */
  };
  uint32_t w;
} __TC_RC_bits_t;

#define TC_RC_RC_Pos                          (0)                                            /**< (TC_RC) Register C Position */
#define TC_RC_RC_Msk                          (0xFFFFFFFFU << TC_RC_RC_Pos)                  /**< (TC_RC) Register C Mask */
#define TC_RC_RC(value)                       (TC_RC_RC_Msk & ((value) << TC_RC_RC_Pos))
#define TC_RC_Msk                             (0xFFFFFFFFUL)                                 /**< (TC_RC) Register Mask  */

/* -------- TC_SR : (TC Offset: 0x20) (R/ 32) Status Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t COVFS:1;                   /**< bit:      0  Counter Overflow Status (cleared on read)     */
    uint32_t LOVRS:1;                   /**< bit:      1  Load Overrun Status (cleared on read)         */
    uint32_t CPAS:1;                    /**< bit:      2  RA Compare Status (cleared on read)           */
    uint32_t CPBS:1;                    /**< bit:      3  RB Compare Status (cleared on read)           */
    uint32_t CPCS:1;                    /**< bit:      4  RC Compare Status (cleared on read)           */
    uint32_t LDRAS:1;                   /**< bit:      5  RA Loading Status (cleared on read)           */
    uint32_t LDRBS:1;                   /**< bit:      6  RB Loading Status (cleared on read)           */
    uint32_t ETRGS:1;                   /**< bit:      7  External Trigger Status (cleared on read)     */
    uint32_t :8;                        /**< bit:  8..15  Reserved                                      */
    uint32_t CLKSTA:1;                  /**< bit:     16  Clock Enabling Status                         */
    uint32_t MTIOA:1;                   /**< bit:     17  TIOAx Mirror                                  */
    uint32_t MTIOB:1;                   /**< bit:     18  TIOBx Mirror                                  */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  uint32_t w;
} __TC_SR_bits_t;

#define TC_SR_COVFS_Pos                       (0)                                            /**< (TC_SR) Counter Overflow Status (cleared on read) Position */
#define TC_SR_COVFS_Msk                       (0x1U << TC_SR_COVFS_Pos)                      /**< (TC_SR) Counter Overflow Status (cleared on read) Mask */
#define TC_SR_LOVRS_Pos                       (1)                                            /**< (TC_SR) Load Overrun Status (cleared on read) Position */
#define TC_SR_LOVRS_Msk                       (0x1U << TC_SR_LOVRS_Pos)                      /**< (TC_SR) Load Overrun Status (cleared on read) Mask */
#define TC_SR_CPAS_Pos                        (2)                                            /**< (TC_SR) RA Compare Status (cleared on read) Position */
#define TC_SR_CPAS_Msk                        (0x1U << TC_SR_CPAS_Pos)                       /**< (TC_SR) RA Compare Status (cleared on read) Mask */
#define TC_SR_CPBS_Pos                        (3)                                            /**< (TC_SR) RB Compare Status (cleared on read) Position */
#define TC_SR_CPBS_Msk                        (0x1U << TC_SR_CPBS_Pos)                       /**< (TC_SR) RB Compare Status (cleared on read) Mask */
#define TC_SR_CPCS_Pos                        (4)                                            /**< (TC_SR) RC Compare Status (cleared on read) Position */
#define TC_SR_CPCS_Msk                        (0x1U << TC_SR_CPCS_Pos)                       /**< (TC_SR) RC Compare Status (cleared on read) Mask */
#define TC_SR_LDRAS_Pos                       (5)                                            /**< (TC_SR) RA Loading Status (cleared on read) Position */
#define TC_SR_LDRAS_Msk                       (0x1U << TC_SR_LDRAS_Pos)                      /**< (TC_SR) RA Loading Status (cleared on read) Mask */
#define TC_SR_LDRBS_Pos                       (6)                                            /**< (TC_SR) RB Loading Status (cleared on read) Position */
#define TC_SR_LDRBS_Msk                       (0x1U << TC_SR_LDRBS_Pos)                      /**< (TC_SR) RB Loading Status (cleared on read) Mask */
#define TC_SR_ETRGS_Pos                       (7)                                            /**< (TC_SR) External Trigger Status (cleared on read) Position */
#define TC_SR_ETRGS_Msk                       (0x1U << TC_SR_ETRGS_Pos)                      /**< (TC_SR) External Trigger Status (cleared on read) Mask */
#define TC_SR_CLKSTA_Pos                      (16)                                           /**< (TC_SR) Clock Enabling Status Position */
#define TC_SR_CLKSTA_Msk                      (0x1U << TC_SR_CLKSTA_Pos)                     /**< (TC_SR) Clock Enabling Status Mask */
#define TC_SR_MTIOA_Pos                       (17)                                           /**< (TC_SR) TIOAx Mirror Position */
#define TC_SR_MTIOA_Msk                       (0x1U << TC_SR_MTIOA_Pos)                      /**< (TC_SR) TIOAx Mirror Mask */
#define TC_SR_MTIOB_Pos                       (18)                                           /**< (TC_SR) TIOBx Mirror Position */
#define TC_SR_MTIOB_Msk                       (0x1U << TC_SR_MTIOB_Pos)                      /**< (TC_SR) TIOBx Mirror Mask */
#define TC_SR_Msk                             (0x000700FFUL)                                 /**< (TC_SR) Register Mask  */

