zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/tc.h
/* -------- TC_IER : (TC Offset: 0x24) (/W 32) Interrupt Enable Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t COVFS:1;                   /**< bit:      0  Counter Overflow                              */
    uint32_t LOVRS:1;                   /**< bit:      1  Load Overrun                                  */
    uint32_t CPAS:1;                    /**< bit:      2  RA Compare                                    */
    uint32_t CPBS:1;                    /**< bit:      3  RB Compare                                    */
    uint32_t CPCS:1;                    /**< bit:      4  RC Compare                                    */
    uint32_t LDRAS:1;                   /**< bit:      5  RA Loading                                    */
    uint32_t LDRBS:1;                   /**< bit:      6  RB Loading                                    */
    uint32_t ETRGS:1;                   /**< bit:      7  External Trigger                              */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __TC_IER_bits_t;

#define TC_IER_COVFS_Pos                      (0)                                            /**< (TC_IER) Counter Overflow Position */
#define TC_IER_COVFS_Msk                      (0x1U << TC_IER_COVFS_Pos)                     /**< (TC_IER) Counter Overflow Mask */
#define TC_IER_LOVRS_Pos                      (1)                                            /**< (TC_IER) Load Overrun Position */
#define TC_IER_LOVRS_Msk                      (0x1U << TC_IER_LOVRS_Pos)                     /**< (TC_IER) Load Overrun Mask */
#define TC_IER_CPAS_Pos                       (2)                                            /**< (TC_IER) RA Compare Position */
#define TC_IER_CPAS_Msk                       (0x1U << TC_IER_CPAS_Pos)                      /**< (TC_IER) RA Compare Mask */
#define TC_IER_CPBS_Pos                       (3)                                            /**< (TC_IER) RB Compare Position */
#define TC_IER_CPBS_Msk                       (0x1U << TC_IER_CPBS_Pos)                      /**< (TC_IER) RB Compare Mask */
#define TC_IER_CPCS_Pos                       (4)                                            /**< (TC_IER) RC Compare Position */
#define TC_IER_CPCS_Msk                       (0x1U << TC_IER_CPCS_Pos)                      /**< (TC_IER) RC Compare Mask */
#define TC_IER_LDRAS_Pos                      (5)                                            /**< (TC_IER) RA Loading Position */
#define TC_IER_LDRAS_Msk                      (0x1U << TC_IER_LDRAS_Pos)                     /**< (TC_IER) RA Loading Mask */
#define TC_IER_LDRBS_Pos                      (6)                                            /**< (TC_IER) RB Loading Position */
#define TC_IER_LDRBS_Msk                      (0x1U << TC_IER_LDRBS_Pos)                     /**< (TC_IER) RB Loading Mask */
#define TC_IER_ETRGS_Pos                      (7)                                            /**< (TC_IER) External Trigger Position */
#define TC_IER_ETRGS_Msk                      (0x1U << TC_IER_ETRGS_Pos)                     /**< (TC_IER) External Trigger Mask */
#define TC_IER_Msk                            (0x000000FFUL)                                 /**< (TC_IER) Register Mask  */

/* -------- TC_IDR : (TC Offset: 0x28) (/W 32) Interrupt Disable Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t COVFS:1;                   /**< bit:      0  Counter Overflow                              */
    uint32_t LOVRS:1;                   /**< bit:      1  Load Overrun                                  */
    uint32_t CPAS:1;                    /**< bit:      2  RA Compare                                    */
    uint32_t CPBS:1;                    /**< bit:      3  RB Compare                                    */
    uint32_t CPCS:1;                    /**< bit:      4  RC Compare                                    */
    uint32_t LDRAS:1;                   /**< bit:      5  RA Loading                                    */
    uint32_t LDRBS:1;                   /**< bit:      6  RB Loading                                    */
    uint32_t ETRGS:1;                   /**< bit:      7  External Trigger                              */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __TC_IDR_bits_t;

#define TC_IDR_COVFS_Pos                      (0)                                            /**< (TC_IDR) Counter Overflow Position */
#define TC_IDR_COVFS_Msk                      (0x1U << TC_IDR_COVFS_Pos)                     /**< (TC_IDR) Counter Overflow Mask */
#define TC_IDR_LOVRS_Pos                      (1)                                            /**< (TC_IDR) Load Overrun Position */
#define TC_IDR_LOVRS_Msk                      (0x1U << TC_IDR_LOVRS_Pos)                     /**< (TC_IDR) Load Overrun Mask */
#define TC_IDR_CPAS_Pos                       (2)                                            /**< (TC_IDR) RA Compare Position */
#define TC_IDR_CPAS_Msk                       (0x1U << TC_IDR_CPAS_Pos)                      /**< (TC_IDR) RA Compare Mask */
#define TC_IDR_CPBS_Pos                       (3)                                            /**< (TC_IDR) RB Compare Position */
#define TC_IDR_CPBS_Msk                       (0x1U << TC_IDR_CPBS_Pos)                      /**< (TC_IDR) RB Compare Mask */
#define TC_IDR_CPCS_Pos                       (4)                                            /**< (TC_IDR) RC Compare Position */
#define TC_IDR_CPCS_Msk                       (0x1U << TC_IDR_CPCS_Pos)                      /**< (TC_IDR) RC Compare Mask */
#define TC_IDR_LDRAS_Pos                      (5)                                            /**< (TC_IDR) RA Loading Position */
#define TC_IDR_LDRAS_Msk                      (0x1U << TC_IDR_LDRAS_Pos)                     /**< (TC_IDR) RA Loading Mask */
#define TC_IDR_LDRBS_Pos                      (6)                                            /**< (TC_IDR) RB Loading Position */
#define TC_IDR_LDRBS_Msk                      (0x1U << TC_IDR_LDRBS_Pos)                     /**< (TC_IDR) RB Loading Mask */
#define TC_IDR_ETRGS_Pos                      (7)                                            /**< (TC_IDR) External Trigger Position */
#define TC_IDR_ETRGS_Msk                      (0x1U << TC_IDR_ETRGS_Pos)                     /**< (TC_IDR) External Trigger Mask */
#define TC_IDR_Msk                            (0x000000FFUL)                                 /**< (TC_IDR) Register Mask  */

/* -------- TC_IMR : (TC Offset: 0x2c) (R/ 32) Interrupt Mask Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t COVFS:1;                   /**< bit:      0  Counter Overflow                              */
    uint32_t LOVRS:1;                   /**< bit:      1  Load Overrun                                  */
    uint32_t CPAS:1;                    /**< bit:      2  RA Compare                                    */
    uint32_t CPBS:1;                    /**< bit:      3  RB Compare                                    */
    uint32_t CPCS:1;                    /**< bit:      4  RC Compare                                    */
    uint32_t LDRAS:1;                   /**< bit:      5  RA Loading                                    */
    uint32_t LDRBS:1;                   /**< bit:      6  RB Loading                                    */
    uint32_t ETRGS:1;                   /**< bit:      7  External Trigger                              */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __TC_IMR_bits_t;

#define TC_IMR_COVFS_Pos                      (0)                                            /**< (TC_IMR) Counter Overflow Position */
#define TC_IMR_COVFS_Msk                      (0x1U << TC_IMR_COVFS_Pos)                     /**< (TC_IMR) Counter Overflow Mask */
#define TC_IMR_LOVRS_Pos                      (1)                                            /**< (TC_IMR) Load Overrun Position */
#define TC_IMR_LOVRS_Msk                      (0x1U << TC_IMR_LOVRS_Pos)                     /**< (TC_IMR) Load Overrun Mask */
#define TC_IMR_CPAS_Pos                       (2)                                            /**< (TC_IMR) RA Compare Position */
#define TC_IMR_CPAS_Msk                       (0x1U << TC_IMR_CPAS_Pos)                      /**< (TC_IMR) RA Compare Mask */
#define TC_IMR_CPBS_Pos                       (3)                                            /**< (TC_IMR) RB Compare Position */
#define TC_IMR_CPBS_Msk                       (0x1U << TC_IMR_CPBS_Pos)                      /**< (TC_IMR) RB Compare Mask */
#define TC_IMR_CPCS_Pos                       (4)                                            /**< (TC_IMR) RC Compare Position */
#define TC_IMR_CPCS_Msk                       (0x1U << TC_IMR_CPCS_Pos)                      /**< (TC_IMR) RC Compare Mask */
#define TC_IMR_LDRAS_Pos                      (5)                                            /**< (TC_IMR) RA Loading Position */
#define TC_IMR_LDRAS_Msk                      (0x1U << TC_IMR_LDRAS_Pos)                     /**< (TC_IMR) RA Loading Mask */
#define TC_IMR_LDRBS_Pos                      (6)                                            /**< (TC_IMR) RB Loading Position */
#define TC_IMR_LDRBS_Msk                      (0x1U << TC_IMR_LDRBS_Pos)                     /**< (TC_IMR) RB Loading Mask */
#define TC_IMR_ETRGS_Pos                      (7)                                            /**< (TC_IMR) External Trigger Position */
#define TC_IMR_ETRGS_Msk                      (0x1U << TC_IMR_ETRGS_Pos)                     /**< (TC_IMR) External Trigger Mask */
#define TC_IMR_Msk                            (0x000000FFUL)                                 /**< (TC_IMR) Register Mask  */

/* -------- TC_EMR : (TC Offset: 0x30) (R/W 32) Extended Mode Register (channel = 0) -------- */

typedef union
{
  struct
  {
    uint32_t TRIGSRCA:2;                /**< bit:   0..1  Trigger Source for Input A                    */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t TRIGSRCB:2;                /**< bit:   4..5  Trigger Source for Input B                    */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t NODIVCLK:1;                /**< bit:      8  No Divided Clock                              */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __TC_EMR_bits_t;

#define TC_EMR_TRIGSRCA_Pos                   (0)                                            /**< (TC_EMR) Trigger Source for Input A Position */
#define TC_EMR_TRIGSRCA_Msk                   (0x3U << TC_EMR_TRIGSRCA_Pos)                  /**< (TC_EMR) Trigger Source for Input A Mask */
#define TC_EMR_TRIGSRCA(value)                (TC_EMR_TRIGSRCA_Msk & ((value) << TC_EMR_TRIGSRCA_Pos))
#define   TC_EMR_TRIGSRCA_EXTERNAL_TIOAx_Val  (0x0U)                                         /**< (TC_EMR) The trigger/capture input A is driven by external pin TIOAx  */
#define   TC_EMR_TRIGSRCA_PWMx_Val            (0x1U)                                         /**< (TC_EMR) The trigger/capture input A is driven internally by PWMx  */
#define TC_EMR_TRIGSRCA_EXTERNAL_TIOAx        (TC_EMR_TRIGSRCA_EXTERNAL_TIOAx_Val << TC_EMR_TRIGSRCA_Pos)  /**< (TC_EMR) The trigger/capture input A is driven by external pin TIOAx Position  */
#define TC_EMR_TRIGSRCA_PWMx                  (TC_EMR_TRIGSRCA_PWMx_Val << TC_EMR_TRIGSRCA_Pos)  /**< (TC_EMR) The trigger/capture input A is driven internally by PWMx Position  */
#define TC_EMR_TRIGSRCB_Pos                   (4)                                            /**< (TC_EMR) Trigger Source for Input B Position */
#define TC_EMR_TRIGSRCB_Msk                   (0x3U << TC_EMR_TRIGSRCB_Pos)                  /**< (TC_EMR) Trigger Source for Input B Mask */
#define TC_EMR_TRIGSRCB(value)                (TC_EMR_TRIGSRCB_Msk & ((value) << TC_EMR_TRIGSRCB_Pos))
#define   TC_EMR_TRIGSRCB_EXTERNAL_TIOBx_Val  (0x0U)                                         /**< (TC_EMR) The trigger/capture input B is driven by external pin TIOBx  */
#define   TC_EMR_TRIGSRCB_PWMx_Val            (0x1U)                                         /**< (TC_EMR) For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC).  */
#define TC_EMR_TRIGSRCB_EXTERNAL_TIOBx        (TC_EMR_TRIGSRCB_EXTERNAL_TIOBx_Val << TC_EMR_TRIGSRCB_Pos)  /**< (TC_EMR) The trigger/capture input B is driven by external pin TIOBx Position  */
#define TC_EMR_TRIGSRCB_PWMx                  (TC_EMR_TRIGSRCB_PWMx_Val << TC_EMR_TRIGSRCB_Pos)  /**< (TC_EMR) For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC). Position  */
#define TC_EMR_NODIVCLK_Pos                   (8)                                            /**< (TC_EMR) No Divided Clock Position */
#define TC_EMR_NODIVCLK_Msk                   (0x1U << TC_EMR_NODIVCLK_Pos)                  /**< (TC_EMR) No Divided Clock Mask */
#define TC_EMR_Msk                            (0x00000133UL)                                 /**< (TC_EMR) Register Mask  */

/* -------- TC_BCR : (TC Offset: 0xc0) (/W 32) Block Control Register -------- */

typedef union
{
  struct
  {
    uint32_t SYNC:1;                    /**< bit:      0  Synchro Command                               */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __TC_BCR_bits_t;

#define TC_BCR_SYNC_Pos                       (0)                                            /**< (TC_BCR) Synchro Command Position */
#define TC_BCR_SYNC_Msk                       (0x1U << TC_BCR_SYNC_Pos)                      /**< (TC_BCR) Synchro Command Mask */
#define TC_BCR_Msk                            (0x00000001UL)                                 /**< (TC_BCR) Register Mask  */

/* -------- TC_BMR : (TC Offset: 0xc4) (R/W 32) Block Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t TC0XC0S:2;                 /**< bit:   0..1  External Clock Signal 0 Selection             */
    uint32_t TC1XC1S:2;                 /**< bit:   2..3  External Clock Signal 1 Selection             */
    uint32_t TC2XC2S:2;                 /**< bit:   4..5  External Clock Signal 2 Selection             */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t QDEN:1;                    /**< bit:      8  Quadrature Decoder Enabled                    */
    uint32_t POSEN:1;                   /**< bit:      9  Position Enabled                              */
    uint32_t SPEEDEN:1;                 /**< bit:     10  Speed Enabled                                 */
    uint32_t QDTRANS:1;                 /**< bit:     11  Quadrature Decoding Transparent               */
    uint32_t EDGPHA:1;                  /**< bit:     12  Edge on PHA Count Mode                        */
    uint32_t INVA:1;                    /**< bit:     13  Inverted PHA                                  */
    uint32_t INVB:1;                    /**< bit:     14  Inverted PHB                                  */
    uint32_t INVIDX:1;                  /**< bit:     15  Inverted Index                                */
    uint32_t SWAP:1;                    /**< bit:     16  Swap PHA and PHB                              */
    uint32_t IDXPHB:1;                  /**< bit:     17  Index Pin is PHB Pin                          */
    uint32_t :2;                        /**< bit: 18..19  Reserved                                      */
    uint32_t MAXFILT:6;                 /**< bit: 20..25  Maximum Filter                                */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __TC_BMR_bits_t;

#define TC_BMR_TC0XC0S_Pos                    (0)                                            /**< (TC_BMR) External Clock Signal 0 Selection Position */
#define TC_BMR_TC0XC0S_Msk                    (0x3U << TC_BMR_TC0XC0S_Pos)                   /**< (TC_BMR) External Clock Signal 0 Selection Mask */
#define TC_BMR_TC0XC0S(value)                 (TC_BMR_TC0XC0S_Msk & ((value) << TC_BMR_TC0XC0S_Pos))
#define   TC_BMR_TC0XC0S_TCLK0_Val            (0x0U)                                         /**< (TC_BMR) Signal connected to XC0: TCLK0  */
#define   TC_BMR_TC0XC0S_TIOA1_Val            (0x2U)                                         /**< (TC_BMR) Signal connected to XC0: TIOA1  */
#define   TC_BMR_TC0XC0S_TIOA2_Val            (0x3U)                                         /**< (TC_BMR) Signal connected to XC0: TIOA2  */
#define TC_BMR_TC0XC0S_TCLK0                  (TC_BMR_TC0XC0S_TCLK0_Val << TC_BMR_TC0XC0S_Pos)  /**< (TC_BMR) Signal connected to XC0: TCLK0 Position  */
#define TC_BMR_TC0XC0S_TIOA1                  (TC_BMR_TC0XC0S_TIOA1_Val << TC_BMR_TC0XC0S_Pos)  /**< (TC_BMR) Signal connected to XC0: TIOA1 Position  */
#define TC_BMR_TC0XC0S_TIOA2                  (TC_BMR_TC0XC0S_TIOA2_Val << TC_BMR_TC0XC0S_Pos)  /**< (TC_BMR) Signal connected to XC0: TIOA2 Position  */
#define TC_BMR_TC1XC1S_Pos                    (2)                                            /**< (TC_BMR) External Clock Signal 1 Selection Position */
#define TC_BMR_TC1XC1S_Msk                    (0x3U << TC_BMR_TC1XC1S_Pos)                   /**< (TC_BMR) External Clock Signal 1 Selection Mask */
#define TC_BMR_TC1XC1S(value)                 (TC_BMR_TC1XC1S_Msk & ((value) << TC_BMR_TC1XC1S_Pos))
#define   TC_BMR_TC1XC1S_TCLK1_Val            (0x0U)                                         /**< (TC_BMR) Signal connected to XC1: TCLK1  */
#define   TC_BMR_TC1XC1S_TIOA0_Val            (0x2U)                                         /**< (TC_BMR) Signal connected to XC1: TIOA0  */
#define   TC_BMR_TC1XC1S_TIOA2_Val            (0x3U)                                         /**< (TC_BMR) Signal connected to XC1: TIOA2  */
#define TC_BMR_TC1XC1S_TCLK1                  (TC_BMR_TC1XC1S_TCLK1_Val << TC_BMR_TC1XC1S_Pos)  /**< (TC_BMR) Signal connected to XC1: TCLK1 Position  */
#define TC_BMR_TC1XC1S_TIOA0                  (TC_BMR_TC1XC1S_TIOA0_Val << TC_BMR_TC1XC1S_Pos)  /**< (TC_BMR) Signal connected to XC1: TIOA0 Position  */
#define TC_BMR_TC1XC1S_TIOA2                  (TC_BMR_TC1XC1S_TIOA2_Val << TC_BMR_TC1XC1S_Pos)  /**< (TC_BMR) Signal connected to XC1: TIOA2 Position  */
#define TC_BMR_TC2XC2S_Pos                    (4)                                            /**< (TC_BMR) External Clock Signal 2 Selection Position */
#define TC_BMR_TC2XC2S_Msk                    (0x3U << TC_BMR_TC2XC2S_Pos)                   /**< (TC_BMR) External Clock Signal 2 Selection Mask */
#define TC_BMR_TC2XC2S(value)                 (TC_BMR_TC2XC2S_Msk & ((value) << TC_BMR_TC2XC2S_Pos))
#define   TC_BMR_TC2XC2S_TCLK2_Val            (0x0U)                                         /**< (TC_BMR) Signal connected to XC2: TCLK2  */
#define   TC_BMR_TC2XC2S_TIOA0_Val            (0x2U)                                         /**< (TC_BMR) Signal connected to XC2: TIOA0  */
#define   TC_BMR_TC2XC2S_TIOA1_Val            (0x3U)                                         /**< (TC_BMR) Signal connected to XC2: TIOA1  */
#define TC_BMR_TC2XC2S_TCLK2                  (TC_BMR_TC2XC2S_TCLK2_Val << TC_BMR_TC2XC2S_Pos)  /**< (TC_BMR) Signal connected to XC2: TCLK2 Position  */
#define TC_BMR_TC2XC2S_TIOA0                  (TC_BMR_TC2XC2S_TIOA0_Val << TC_BMR_TC2XC2S_Pos)  /**< (TC_BMR) Signal connected to XC2: TIOA0 Position  */
#define TC_BMR_TC2XC2S_TIOA1                  (TC_BMR_TC2XC2S_TIOA1_Val << TC_BMR_TC2XC2S_Pos)  /**< (TC_BMR) Signal connected to XC2: TIOA1 Position  */
#define TC_BMR_QDEN_Pos                       (8)                                            /**< (TC_BMR) Quadrature Decoder Enabled Position */
#define TC_BMR_QDEN_Msk                       (0x1U << TC_BMR_QDEN_Pos)                      /**< (TC_BMR) Quadrature Decoder Enabled Mask */
#define TC_BMR_POSEN_Pos                      (9)                                            /**< (TC_BMR) Position Enabled Position */
#define TC_BMR_POSEN_Msk                      (0x1U << TC_BMR_POSEN_Pos)                     /**< (TC_BMR) Position Enabled Mask */
#define TC_BMR_SPEEDEN_Pos                    (10)                                           /**< (TC_BMR) Speed Enabled Position */
#define TC_BMR_SPEEDEN_Msk                    (0x1U << TC_BMR_SPEEDEN_Pos)                   /**< (TC_BMR) Speed Enabled Mask */
#define TC_BMR_QDTRANS_Pos                    (11)                                           /**< (TC_BMR) Quadrature Decoding Transparent Position */
#define TC_BMR_QDTRANS_Msk                    (0x1U << TC_BMR_QDTRANS_Pos)                   /**< (TC_BMR) Quadrature Decoding Transparent Mask */
#define TC_BMR_EDGPHA_Pos                     (12)                                           /**< (TC_BMR) Edge on PHA Count Mode Position */
#define TC_BMR_EDGPHA_Msk                     (0x1U << TC_BMR_EDGPHA_Pos)                    /**< (TC_BMR) Edge on PHA Count Mode Mask */
#define TC_BMR_INVA_Pos                       (13)                                           /**< (TC_BMR) Inverted PHA Position */
#define TC_BMR_INVA_Msk                       (0x1U << TC_BMR_INVA_Pos)                      /**< (TC_BMR) Inverted PHA Mask */
#define TC_BMR_INVB_Pos                       (14)                                           /**< (TC_BMR) Inverted PHB Position */
#define TC_BMR_INVB_Msk                       (0x1U << TC_BMR_INVB_Pos)                      /**< (TC_BMR) Inverted PHB Mask */
#define TC_BMR_INVIDX_Pos                     (15)                                           /**< (TC_BMR) Inverted Index Position */
#define TC_BMR_INVIDX_Msk                     (0x1U << TC_BMR_INVIDX_Pos)                    /**< (TC_BMR) Inverted Index Mask */
#define TC_BMR_SWAP_Pos                       (16)                                           /**< (TC_BMR) Swap PHA and PHB Position */
#define TC_BMR_SWAP_Msk                       (0x1U << TC_BMR_SWAP_Pos)                      /**< (TC_BMR) Swap PHA and PHB Mask */
#define TC_BMR_IDXPHB_Pos                     (17)                                           /**< (TC_BMR) Index Pin is PHB Pin Position */
#define TC_BMR_IDXPHB_Msk                     (0x1U << TC_BMR_IDXPHB_Pos)                    /**< (TC_BMR) Index Pin is PHB Pin Mask */
#define TC_BMR_MAXFILT_Pos                    (20)                                           /**< (TC_BMR) Maximum Filter Position */
#define TC_BMR_MAXFILT_Msk                    (0x3FU << TC_BMR_MAXFILT_Pos)                  /**< (TC_BMR) Maximum Filter Mask */
#define TC_BMR_MAXFILT(value)                 (TC_BMR_MAXFILT_Msk & ((value) << TC_BMR_MAXFILT_Pos))
#define TC_BMR_Msk                            (0x03F3FF3FUL)                                 /**< (TC_BMR) Register Mask  */

/* -------- TC_QIER : (TC Offset: 0xc8) (/W 32) QDEC Interrupt Enable Register -------- */

