zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/tc.h
typedef union
{
  struct
  {
    uint32_t IDX:1;                     /**< bit:      0  Index                                         */
    uint32_t DIRCHG:1;                  /**< bit:      1  Direction Change                              */
    uint32_t QERR:1;                    /**< bit:      2  Quadrature Error                              */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __TC_QIER_bits_t;

#define TC_QIER_IDX_Pos                       (0)                                            /**< (TC_QIER) Index Position */
#define TC_QIER_IDX_Msk                       (0x1U << TC_QIER_IDX_Pos)                      /**< (TC_QIER) Index Mask */
#define TC_QIER_DIRCHG_Pos                    (1)                                            /**< (TC_QIER) Direction Change Position */
#define TC_QIER_DIRCHG_Msk                    (0x1U << TC_QIER_DIRCHG_Pos)                   /**< (TC_QIER) Direction Change Mask */
#define TC_QIER_QERR_Pos                      (2)                                            /**< (TC_QIER) Quadrature Error Position */
#define TC_QIER_QERR_Msk                      (0x1U << TC_QIER_QERR_Pos)                     /**< (TC_QIER) Quadrature Error Mask */
#define TC_QIER_Msk                           (0x00000007UL)                                 /**< (TC_QIER) Register Mask  */

/* -------- TC_QIDR : (TC Offset: 0xcc) (/W 32) QDEC Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t IDX:1;                     /**< bit:      0  Index                                         */
    uint32_t DIRCHG:1;                  /**< bit:      1  Direction Change                              */
    uint32_t QERR:1;                    /**< bit:      2  Quadrature Error                              */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __TC_QIDR_bits_t;

#define TC_QIDR_IDX_Pos                       (0)                                            /**< (TC_QIDR) Index Position */
#define TC_QIDR_IDX_Msk                       (0x1U << TC_QIDR_IDX_Pos)                      /**< (TC_QIDR) Index Mask */
#define TC_QIDR_DIRCHG_Pos                    (1)                                            /**< (TC_QIDR) Direction Change Position */
#define TC_QIDR_DIRCHG_Msk                    (0x1U << TC_QIDR_DIRCHG_Pos)                   /**< (TC_QIDR) Direction Change Mask */
#define TC_QIDR_QERR_Pos                      (2)                                            /**< (TC_QIDR) Quadrature Error Position */
#define TC_QIDR_QERR_Msk                      (0x1U << TC_QIDR_QERR_Pos)                     /**< (TC_QIDR) Quadrature Error Mask */
#define TC_QIDR_Msk                           (0x00000007UL)                                 /**< (TC_QIDR) Register Mask  */

/* -------- TC_QIMR : (TC Offset: 0xd0) (R/ 32) QDEC Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t IDX:1;                     /**< bit:      0  Index                                         */
    uint32_t DIRCHG:1;                  /**< bit:      1  Direction Change                              */
    uint32_t QERR:1;                    /**< bit:      2  Quadrature Error                              */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __TC_QIMR_bits_t;

#define TC_QIMR_IDX_Pos                       (0)                                            /**< (TC_QIMR) Index Position */
#define TC_QIMR_IDX_Msk                       (0x1U << TC_QIMR_IDX_Pos)                      /**< (TC_QIMR) Index Mask */
#define TC_QIMR_DIRCHG_Pos                    (1)                                            /**< (TC_QIMR) Direction Change Position */
#define TC_QIMR_DIRCHG_Msk                    (0x1U << TC_QIMR_DIRCHG_Pos)                   /**< (TC_QIMR) Direction Change Mask */
#define TC_QIMR_QERR_Pos                      (2)                                            /**< (TC_QIMR) Quadrature Error Position */
#define TC_QIMR_QERR_Msk                      (0x1U << TC_QIMR_QERR_Pos)                     /**< (TC_QIMR) Quadrature Error Mask */
#define TC_QIMR_Msk                           (0x00000007UL)                                 /**< (TC_QIMR) Register Mask  */

/* -------- TC_QISR : (TC Offset: 0xd4) (R/ 32) QDEC Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t IDX:1;                     /**< bit:      0  Index                                         */
    uint32_t DIRCHG:1;                  /**< bit:      1  Direction Change                              */
    uint32_t QERR:1;                    /**< bit:      2  Quadrature Error                              */
    uint32_t :5;                        /**< bit:   3..7  Reserved                                      */
    uint32_t DIR:1;                     /**< bit:      8  Direction                                     */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __TC_QISR_bits_t;

#define TC_QISR_IDX_Pos                       (0)                                            /**< (TC_QISR) Index Position */
#define TC_QISR_IDX_Msk                       (0x1U << TC_QISR_IDX_Pos)                      /**< (TC_QISR) Index Mask */
#define TC_QISR_DIRCHG_Pos                    (1)                                            /**< (TC_QISR) Direction Change Position */
#define TC_QISR_DIRCHG_Msk                    (0x1U << TC_QISR_DIRCHG_Pos)                   /**< (TC_QISR) Direction Change Mask */
#define TC_QISR_QERR_Pos                      (2)                                            /**< (TC_QISR) Quadrature Error Position */
#define TC_QISR_QERR_Msk                      (0x1U << TC_QISR_QERR_Pos)                     /**< (TC_QISR) Quadrature Error Mask */
#define TC_QISR_DIR_Pos                       (8)                                            /**< (TC_QISR) Direction Position */
#define TC_QISR_DIR_Msk                       (0x1U << TC_QISR_DIR_Pos)                      /**< (TC_QISR) Direction Mask */
#define TC_QISR_Msk                           (0x00000107UL)                                 /**< (TC_QISR) Register Mask  */

