zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/tc.h
/* -------- TC_FMR : (TC Offset: 0xd8) (R/W 32) Fault Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t ENCF0:1;                   /**< bit:      0  Enable Compare Fault Channel 0                */
    uint32_t ENCF1:1;                   /**< bit:      1  Enable Compare Fault Channel 1                */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  struct
  {
    uint32_t ENCF:2;                    /**< bit:   0..1  Enable Compare Fault Channel x                */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __TC_FMR_bits_t;

#define TC_FMR_ENCF0_Pos                      (0)                                            /**< (TC_FMR) Enable Compare Fault Channel 0 Position */
#define TC_FMR_ENCF0_Msk                      (0x1U << TC_FMR_ENCF0_Pos)                     /**< (TC_FMR) Enable Compare Fault Channel 0 Mask */
#define TC_FMR_ENCF1_Pos                      (1)                                            /**< (TC_FMR) Enable Compare Fault Channel 1 Position */
#define TC_FMR_ENCF1_Msk                      (0x1U << TC_FMR_ENCF1_Pos)                     /**< (TC_FMR) Enable Compare Fault Channel 1 Mask */
#define TC_FMR_Msk                            (0x00000003UL)                                 /**< (TC_FMR) Register Mask  */
#define TC_FMR_ENCF_Pos                       (0)                                            /**< (TC_FMR Position) Enable Compare Fault Channel x */
#define TC_FMR_ENCF_Msk                       (0x3U << TC_FMR_ENCF_Pos)                      /**< (TC_FMR Mask) ENCF */
#define TC_FMR_ENCF(value)                    (TC_FMR_ENCF_Msk & ((value) << TC_FMR_ENCF_Pos))

/* -------- TC_WPMR : (TC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __TC_WPMR_bits_t;

#define TC_WPMR_WPEN_Pos                      (0)                                            /**< (TC_WPMR) Write Protection Enable Position */
#define TC_WPMR_WPEN_Msk                      (0x1U << TC_WPMR_WPEN_Pos)                     /**< (TC_WPMR) Write Protection Enable Mask */
#define TC_WPMR_WPKEY_Pos                     (8)                                            /**< (TC_WPMR) Write Protection Key Position */
#define TC_WPMR_WPKEY_Msk                     (0xFFFFFFU << TC_WPMR_WPKEY_Pos)               /**< (TC_WPMR) Write Protection Key Mask */
#define TC_WPMR_WPKEY(value)                  (TC_WPMR_WPKEY_Msk & ((value) << TC_WPMR_WPKEY_Pos))
#define   TC_WPMR_WPKEY_PASSWD_Val            (0x54494DU)                                    /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define TC_WPMR_WPKEY_PASSWD                  (TC_WPMR_WPKEY_PASSWD_Val << TC_WPMR_WPKEY_Pos)  /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define TC_WPMR_Msk                           (0xFFFFFF01UL)                                 /**< (TC_WPMR) Register Mask  */

/** \brief TC_CHANNEL register offsets definitions */
#define TC_CCR_OFFSET                (0x00)         /**< (TC_CCR) Channel Control Register (channel = 0) Offset */
#define TC_CMR_OFFSET                (0x04)         /**< (TC_CMR) Channel Mode Register (channel = 0) Offset */
#define TC_SMMR_OFFSET               (0x08)         /**< (TC_SMMR) Stepper Motor Mode Register (channel = 0) Offset */
#define TC_RAB_OFFSET                (0x0C)         /**< (TC_RAB) Register AB (channel = 0) Offset */
#define TC_CV_OFFSET                 (0x10)         /**< (TC_CV) Counter Value (channel = 0) Offset */
#define TC_RA_OFFSET                 (0x14)         /**< (TC_RA) Register A (channel = 0) Offset */
#define TC_RB_OFFSET                 (0x18)         /**< (TC_RB) Register B (channel = 0) Offset */
#define TC_RC_OFFSET                 (0x1C)         /**< (TC_RC) Register C (channel = 0) Offset */
#define TC_SR_OFFSET                 (0x20)         /**< (TC_SR) Status Register (channel = 0) Offset */
#define TC_IER_OFFSET                (0x24)         /**< (TC_IER) Interrupt Enable Register (channel = 0) Offset */
#define TC_IDR_OFFSET                (0x28)         /**< (TC_IDR) Interrupt Disable Register (channel = 0) Offset */
#define TC_IMR_OFFSET                (0x2C)         /**< (TC_IMR) Interrupt Mask Register (channel = 0) Offset */
#define TC_EMR_OFFSET                (0x30)         /**< (TC_EMR) Extended Mode Register (channel = 0) Offset */
/** \brief TC register offsets definitions */
#define TC_BCR_OFFSET                (0xC0)         /**< (TC_BCR) Block Control Register Offset */
#define TC_BMR_OFFSET                (0xC4)         /**< (TC_BMR) Block Mode Register Offset */
#define TC_QIER_OFFSET               (0xC8)         /**< (TC_QIER) QDEC Interrupt Enable Register Offset */
#define TC_QIDR_OFFSET               (0xCC)         /**< (TC_QIDR) QDEC Interrupt Disable Register Offset */
#define TC_QIMR_OFFSET               (0xD0)         /**< (TC_QIMR) QDEC Interrupt Mask Register Offset */
#define TC_QISR_OFFSET               (0xD4)         /**< (TC_QISR) QDEC Interrupt Status Register Offset */
#define TC_FMR_OFFSET                (0xD8)         /**< (TC_FMR) Fault Mode Register Offset */
#define TC_WPMR_OFFSET               (0xE4)         /**< (TC_WPMR) Write Protection Mode Register Offset */

/** \brief TC_CHANNEL register API structure */
typedef struct
{
  __O   __TC_CCR_bits_t                TC_CCR;        /**< Offset: 0x00 ( /W  32) Channel Control Register (channel = 0) */
  __IO  __TC_CMR_bits_t                TC_CMR;        /**< Offset: 0x04 (R/W  32) Channel Mode Register (channel = 0) */
  __IO  __TC_SMMR_bits_t               TC_SMMR;       /**< Offset: 0x08 (R/W  32) Stepper Motor Mode Register (channel = 0) */
  __I   __TC_RAB_bits_t                TC_RAB;        /**< Offset: 0x0C (R/   32) Register AB (channel = 0) */
  __I   __TC_CV_bits_t                 TC_CV;         /**< Offset: 0x10 (R/   32) Counter Value (channel = 0) */
  __IO  __TC_RA_bits_t                 TC_RA;         /**< Offset: 0x14 (R/W  32) Register A (channel = 0) */
  __IO  __TC_RB_bits_t                 TC_RB;         /**< Offset: 0x18 (R/W  32) Register B (channel = 0) */
  __IO  __TC_RC_bits_t                 TC_RC;         /**< Offset: 0x1C (R/W  32) Register C (channel = 0) */
  __I   __TC_SR_bits_t                 TC_SR;         /**< Offset: 0x20 (R/   32) Status Register (channel = 0) */
  __O   __TC_IER_bits_t                TC_IER;        /**< Offset: 0x24 ( /W  32) Interrupt Enable Register (channel = 0) */
  __O   __TC_IDR_bits_t                TC_IDR;        /**< Offset: 0x28 ( /W  32) Interrupt Disable Register (channel = 0) */
  __I   __TC_IMR_bits_t                TC_IMR;        /**< Offset: 0x2C (R/   32) Interrupt Mask Register (channel = 0) */
  __IO  __TC_EMR_bits_t                TC_EMR;        /**< Offset: 0x30 (R/W  32) Extended Mode Register (channel = 0) */
  __I   uint8_t                        Reserved1[0x0C];
} tcchannel_registers_t;

#define TCCHANNEL_NUMBER 3
/** \brief TC register API structure */
typedef struct
{
        tcchannel_registers_t          TC_CHANNEL[TCCHANNEL_NUMBER]; /**< Offset: 0x00 Channel Control Register (channel = 0) */
  __O   __TC_BCR_bits_t                TC_BCR;        /**< Offset: 0xC0 ( /W  32) Block Control Register */
  __IO  __TC_BMR_bits_t                TC_BMR;        /**< Offset: 0xC4 (R/W  32) Block Mode Register */
  __O   __TC_QIER_bits_t               TC_QIER;       /**< Offset: 0xC8 ( /W  32) QDEC Interrupt Enable Register */
  __O   __TC_QIDR_bits_t               TC_QIDR;       /**< Offset: 0xCC ( /W  32) QDEC Interrupt Disable Register */
  __I   __TC_QIMR_bits_t               TC_QIMR;       /**< Offset: 0xD0 (R/   32) QDEC Interrupt Mask Register */
  __I   __TC_QISR_bits_t               TC_QISR;       /**< Offset: 0xD4 (R/   32) QDEC Interrupt Status Register */
  __IO  __TC_FMR_bits_t                TC_FMR;        /**< Offset: 0xD8 (R/W  32) Fault Mode Register */
  __I   uint8_t                        Reserved1[0x08];
  __IO  __TC_WPMR_bits_t               TC_WPMR;       /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
} tc_registers_t;
/** @}  end of Timer Counter */

#endif /* _PIC32CZ_CA70_TC_COMPONENT_H_ */
